# Pandas

In [1]:
!pip install pandas
# Dataframe - Special Object to data in tabular form

Requirement already satisfied: pandas in c:\users\mayur\appdata\local\programs\python\python310\lib\site-packages (1.3.5)
Requirement already satisfied: pytz>=2017.3 in c:\users\mayur\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\mayur\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.22.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\mayur\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\mayur\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

WARNING: You are using pip version 21.2.3; however, version 22.3.1 is available.
You should consider upgrading via the 'C:\Users\Mayur\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

In [2]:
import numpy as np
import pandas as pd

In [4]:
user_data = {
    "MarksA" : np.random.randint(1, 100, 5),
    "MarksB" : np.random.randint(1, 100, 5),
    "MarksC" : np.random.randint(1, 100, 5)
}

In [5]:
user_data

{'MarksA': array([81, 22, 19,  7, 78]),
 'MarksB': array([36, 78, 64, 98, 98]),
 'MarksC': array([79, 84, 15, 60, 84])}

In [9]:
df = pd.DataFrame(user_data, dtype='float')

In [11]:
df.head(3)

   MarksA  MarksB  MarksC
0    81.0    36.0    79.0
1    22.0    78.0    84.0
2    19.0    64.0    15.0

In [12]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [22]:
df.to_csv('marks.csv')
df.to_csv('marks.csv', index=False)

In [23]:
my_data = pd.read_csv('marks.csv')
# my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   MarksA  MarksB  MarksC
0    81.0    36.0    79.0
1    22.0    78.0    84.0
2    19.0    64.0    15.0
3     7.0    98.0    60.0
4    78.0    98.0    84.0

In [25]:
my_data.describe()

          MarksA     MarksB     MarksC
count   5.000000   5.000000   5.000000
mean   41.400000  74.800000  64.400000
std    35.246276  26.023067  29.330871
min     7.000000  36.000000  15.000000
25%    19.000000  64.000000  60.000000
50%    22.000000  78.000000  79.000000
75%    78.000000  98.000000  84.000000
max    81.000000  98.000000  84.000000

In [26]:
my_data.tail(3)

   MarksA  MarksB  MarksC
2    19.0    64.0    15.0
3     7.0    98.0    60.0
4    78.0    98.0    84.0

In [27]:
# Row
df.iloc[3]

MarksA     7.0
MarksB    98.0
MarksC    60.0
Name: 3, dtype: float64

In [28]:
df.iloc[3,1]

98.0

In [30]:
idx = df.columns.get_loc('MarksB')
df.iloc[:3, idx :]

   MarksB  MarksC
0    36.0    79.0
1    78.0    84.0
2    64.0    15.0

In [31]:
# Sort your Dataframe
my_data.sort_values(by=["MarksA"], ascending=True)

   MarksA  MarksB  MarksC
3     7.0    98.0    60.0
2    19.0    64.0    15.0
1    22.0    78.0    84.0
4    78.0    98.0    84.0
0    81.0    36.0    79.0

In [32]:
# DataFrame to Numpy array
data_array = my_data.values
print(data_array.shape)
print(type(data_array))

(5, 3)
<class 'numpy.ndarray'>

In [33]:
new_df = pd.DataFrame(data_array, dtype='int32', columns = ['Physics', "Chemistry", "Maths"])

In [34]:
new_df

   Physics  Chemistry  Maths
0       81         36     79
1       22         78     84
2       19         64     15
3        7         98     60
4       78         98     84

# Loading & Visualising MNIST Dataset using Pandas & Matplotlib

In [35]:
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv('../Datasets/mnist_train.csv')    # Download the dataset

In [ ]:
X = data[ : , 1 : ] 
Y = data[ : , 0]

In [ ]:
print(X.shape, Y.shape)

In [ ]:
def drawImg(X, Y, i):
    plt.imshow(X[i].reshape(28, 28), cmap='grey')
    plt.show()

In [ ]:
# Split this dataset
split = int(0.80*X.shape[0])
print(split)

In [ ]:
X_train, Y_train = X[ : split, : ], Y[ : split]
X_test, Y_test = X[split : , : ], Y[split : ]

print(X_train.shape, Y_train.shape, X_test.shape, Y_test.shape)

In [ ]:
from sklearn.model_selection import train_test_split
X_train, Y_train, X_test, Y_test = train_test_split(X, Y, test_size = 0.2, random_state = 5)

In [ ]:
# Randomization
# should be do on dataset itself
import numpy as np
a = np.array([[1, 2, 3],
              [4, 5, 6],
              [7, 8, 9]])

np.random.shuffle(a)
print(a)

In [ ]:
# Try to plot Visualization 
plt.figure(figsize = (10, 10))
for i in range(25):
    plt.subplot(5, 5, i+1)
    plt.imshow(X_train[i].reshape(28, 28), cmap='grey')
    plt.title(Y_train[i])
    plt.axis("off")